20241030T184511--kdoc-256-dnsフィルタリングで断つ指針__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 256: DNSフィルタリングで断つ指針</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../roam/css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 256: DNSフィルタリングで断つ指針</h1>

<div id="outline-container-org2d9d5ba" class="outline-2">
<h2 id="org2d9d5ba"><a href="#org2d9d5ba">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org2d9d5ba">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-04 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-07 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgaab2023" class="outline-2">
<h2 id="orgaab2023"><a href="#orgaab2023">概要</a></h2>
<div class="outline-text-2" id="text-orgaab2023">
<p>
インターネット上のコンテンツ(ポルノ、ゲーム、ツイート…)はたやすく依存症を引き起こし、心身に有害をもたらす。ベーシックな療法はほかの依存症と同じく、「断つ」ことである。ほかの依存性のあるものと違って、インターネットコンテンツは無限にあり、少し指を運動するだけでアクセスできる。ハードルはとても低く、意志による克服はむずかしい。フィルタリングによって、有害コンテンツを完全に遮断する指針を示す。
</p>
</div>
</div>

<div id="outline-container-org8579479" class="outline-2">
<h2 id="org8579479"><a href="#org8579479">ポイント</a></h2>
<div class="outline-text-2" id="text-org8579479">
<p>
断つポイントとしては2つある。
</p>

<ul class="org-ul">
<li><p>
すべての端末で遮断すること
</p>

<p>
特定の端末だけ遮断、だとそこが抜け道となって破綻する。少しでも見てしまうと、抗うのは難しい。なのでPCやスマホ、持っているすべての端末で遮断する必要がある。
</p></li>

<li><p>
検索を防ぐこと
</p>

<p>
URLで遮断するのは真っ先に行うべきことであるが、じゅうぶんではない。検索が抜け道となってしまう。代替のものを探し出し、破綻する。また、無限にあるURLを都度遮断設定してもきりがない。検索からも有害な内容を遮断できる必要がある。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgbb3bd4c" class="outline-2">
<h2 id="orgbb3bd4c"><a href="#orgbb3bd4c">方法</a></h2>
<div class="outline-text-2" id="text-orgbb3bd4c">
<p>
それぞれ、具体的にどうすればいいだろうか。
</p>

<p>
全端末での遮断、を行うためには各端末での遮断ではなくネットワーク側で遮断するとよい。ルータの機能や、DNSサーバによる遮断がある。
</p>

<p>
次に、検索を防ぐ。以下のようにして検索を防げる。
</p>

<ul class="org-ul">
<li>セーフサーチを強制する
<ul class="org-ul">
<li>強制モードではない場合、簡単にオフにできてしまう</li>
<li>DNSフィルタリングのアプリケーションに強制セーフサーチ機能があるものがある。例えば<a href="https://github.com/AdguardTeam/AdGuardHome">AdguardTeam/AdGuardHome</a></li>
</ul></li>
<li>強化セーフサーチフィルタリングを設定する
<ul class="org-ul">
<li>Googleアカウントの設定から行える</li>
<li>検索結果に含まれる有害コンテンツが排除される。テキストやサムネイルも非表示となる</li>
</ul></li>
<li>Chrome拡張で、キーワードで検索結果から排除する
<ul class="org-ul">
<li>セーフサーチだけではきわどいものは検索結果に出てしまうことがある</li>
<li><a href="https://chromewebstore.google.com/detail/ublacklist/pncfbmialoiaghdehhbnbhkkgmjanfhe?hl=en">ublacklist</a>を使うと、キーワードで非表示にできる</li>
</ul></li>
</ul>

<p>
ということで、遮断の主たる役割を果たすのはDNSフィルタリングである。途中で名前を出したが、<a href="https://github.com/AdguardTeam/AdGuardHome">AdGuardHome</a>が扱いやすい。家のルータに設定すれば、強力に遮断できる。
</p>

<p>
<code>docker compose</code> で簡単に起動でき、設定を<a href="20210901104129-git.html#ID-90c6b715-9324-46ce-a354-63d09403b066">Git</a>管理できるのもよいところだ。設定は<a href="https://github.com/kijimaD/dotfiles/tree/main/adguard">dotfiles/adguard</a>に上げた。
</p>
</div>
</div>

<div id="outline-container-orgdb5c572" class="outline-2">
<h2 id="orgdb5c572"><a href="#orgdb5c572">関連</a></h2>
<div class="outline-text-2" id="text-orgdb5c572">
<ul class="org-ul">
<li><a href="20240224T025714--kdoc-103-ゆるいインターネット断ちのやり方__essay.html#ID-20240224T025714">KDOC 103: ゆるいインターネット断ちのやり方</a>。以前の方法。甘かったため、じゅうぶんな効果がなかった</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
